Ran Plan for 2 projects:

1. dir: `nz3es/gcp/stg/australia-southeast2` workspace: `nz3es_gcp_stg_australia-southeast2`
1. dir: `nz3es/gcp/prd/australia-southeast2` workspace: `nz3es_gcp_prd_australia-southeast2`
---

### 1. dir: `nz3es/gcp/stg/australia-southeast2` workspace: `nz3es_gcp_stg_australia-southeast2`
<details><summary>Show Output</summary>

```diff
Workspace directory does not exist yet, skipping cache cleanup

09:53:43.553 STDOUT terraform1.13.3: Terraform used the selected providers to generate the following execution
09:53:43.555 STDOUT terraform1.13.3: plan. Resource actions are indicated with the following symbols:
09:53:43.555 STDOUT terraform1.13.3:   + create
09:53:43.555 STDOUT terraform1.13.3: Terraform will perform the following actions:
09:53:43.555 STDOUT terraform1.13.3:   # google_compute_network.vpc_network will be created
09:53:43.556 STDOUT terraform1.13.3:   + resource "google_compute_network" "vpc_network" {
09:53:43.556 STDOUT terraform1.13.3:       + auto_create_subnetworks                   = false
09:53:43.556 STDOUT terraform1.13.3:       + bgp_always_compare_med                    = (known after apply)
09:53:43.556 STDOUT terraform1.13.3:       + bgp_best_path_selection_mode              = (known after apply)
09:53:43.556 STDOUT terraform1.13.3:       + bgp_inter_region_cost                     = (known after apply)
09:53:43.556 STDOUT terraform1.13.3:       + delete_bgp_always_compare_med             = false
09:53:43.556 STDOUT terraform1.13.3:       + delete_default_routes_on_create           = false
09:53:43.557 STDOUT terraform1.13.3:       + gateway_ipv4                              = (known after apply)
09:53:43.557 STDOUT terraform1.13.3:       + id                                        = (known after apply)
09:53:43.557 STDOUT terraform1.13.3:       + internal_ipv6_range                       = (known after apply)
09:53:43.557 STDOUT terraform1.13.3:       + mtu                                       = (known after apply)
09:53:43.557 STDOUT terraform1.13.3:       + name                                      = "stg-vpc-australia-southeast2"
09:53:43.557 STDOUT terraform1.13.3:       + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
09:53:43.558 STDOUT terraform1.13.3:       + network_id                                = (known after apply)
09:53:43.558 STDOUT terraform1.13.3:       + numeric_id                                = (known after apply)
09:53:43.558 STDOUT terraform1.13.3:       + project                                   = "iac-01"
09:53:43.558 STDOUT terraform1.13.3:       + routing_mode                              = (known after apply)
09:53:43.558 STDOUT terraform1.13.3:       + self_link                                 = (known after apply)
09:53:43.558 STDOUT terraform1.13.3:     }
09:53:43.558 STDOUT terraform1.13.3:   # google_compute_subnetwork.subnet will be created
09:53:43.559 STDOUT terraform1.13.3:   + resource "google_compute_subnetwork" "subnet" {
09:53:43.559 STDOUT terraform1.13.3:       + creation_timestamp         = (known after apply)
09:53:43.559 STDOUT terraform1.13.3:       + external_ipv6_prefix       = (known after apply)
09:53:43.559 STDOUT terraform1.13.3:       + fingerprint                = (known after apply)
09:53:43.559 STDOUT terraform1.13.3:       + gateway_address            = (known after apply)
09:53:43.559 STDOUT terraform1.13.3:       + id                         = (known after apply)
09:53:43.559 STDOUT terraform1.13.3:       + internal_ipv6_prefix       = (known after apply)
09:53:43.559 STDOUT terraform1.13.3:       + ip_cidr_range              = "10.1.0.0/24"
09:53:43.560 STDOUT terraform1.13.3:       + ipv6_cidr_range            = (known after apply)
09:53:43.560 STDOUT terraform1.13.3:       + ipv6_gce_endpoint          = (known after apply)
09:53:43.560 STDOUT terraform1.13.3:       + name                       = "stg-vpc-australia-southeast2-subnet"
09:53:43.560 STDOUT terraform1.13.3:       + network                    = (known after apply)
09:53:43.560 STDOUT terraform1.13.3:       + private_ip_google_access   = (known after apply)
09:53:43.560 STDOUT terraform1.13.3:       + private_ipv6_google_access = (known after apply)
09:53:43.560 STDOUT terraform1.13.3:       + project                    = "iac-01"
09:53:43.560 STDOUT terraform1.13.3:       + purpose                    = (known after apply)
09:53:43.561 STDOUT terraform1.13.3:       + region                     = "australia-southeast2"
09:53:43.561 STDOUT terraform1.13.3:       + self_link                  = (known after apply)
09:53:43.561 STDOUT terraform1.13.3:       + stack_type                 = (known after apply)
09:53:43.561 STDOUT terraform1.13.3:       + state                      = (known after apply)
09:53:43.561 STDOUT terraform1.13.3:       + subnetwork_id              = (known after apply)
09:53:43.561 STDOUT terraform1.13.3:       + secondary_ip_range (known after apply)
09:53:43.561 STDOUT terraform1.13.3:     }
09:53:43.562 STDOUT terraform1.13.3: Plan: 2 to add, 0 to change, 0 to destroy.
09:53:43.562 STDOUT terraform1.13.3: 
09:53:43.562 STDOUT terraform1.13.3: Changes to Outputs:
09:53:43.562 STDOUT terraform1.13.3:   + network_id       = (known after apply)
09:53:43.562 STDOUT terraform1.13.3:   + subnet_self_link = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d nz3es/gcp/stg/australia-southeast2 -w nz3es_gcp_stg_australia-southeast2
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://www.3es.nz/lock?id=esquare666%252Fiac%252Fnz3es%252Fgcp%252Fstg%252Faustralia-southeast2%252Fnz3es_gcp_stg_australia-southeast2)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d nz3es/gcp/stg/australia-southeast2 -w nz3es_gcp_stg_australia-southeast2
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 2. dir: `nz3es/gcp/prd/australia-southeast2` workspace: `nz3es_gcp_prd_australia-southeast2`
<details><summary>Show Output</summary>

```diff
Workspace directory does not exist yet, skipping cache cleanup

09:53:43.589 STDOUT terraform1.13.3: Terraform used the selected providers to generate the following execution
09:53:43.589 STDOUT terraform1.13.3: plan. Resource actions are indicated with the following symbols:
09:53:43.589 STDOUT terraform1.13.3:   + create
09:53:43.589 STDOUT terraform1.13.3: Terraform will perform the following actions:
09:53:43.590 STDOUT terraform1.13.3:   # google_compute_network.vpc_network will be created
09:53:43.590 STDOUT terraform1.13.3:   + resource "google_compute_network" "vpc_network" {
09:53:43.590 STDOUT terraform1.13.3:       + auto_create_subnetworks                   = false
09:53:43.590 STDOUT terraform1.13.3:       + bgp_always_compare_med                    = (known after apply)
09:53:43.590 STDOUT terraform1.13.3:       + bgp_best_path_selection_mode              = (known after apply)
09:53:43.590 STDOUT terraform1.13.3:       + bgp_inter_region_cost                     = (known after apply)
09:53:43.590 STDOUT terraform1.13.3:       + delete_bgp_always_compare_med             = false
09:53:43.591 STDOUT terraform1.13.3:       + delete_default_routes_on_create           = false
09:53:43.591 STDOUT terraform1.13.3:       + gateway_ipv4                              = (known after apply)
09:53:43.591 STDOUT terraform1.13.3:       + id                                        = (known after apply)
09:53:43.591 STDOUT terraform1.13.3:       + internal_ipv6_range                       = (known after apply)
09:53:43.591 STDOUT terraform1.13.3:       + mtu                                       = (known after apply)
09:53:43.591 STDOUT terraform1.13.3:       + name                                      = "prd-vpc-australia-southeast2"
09:53:43.592 STDOUT terraform1.13.3:       + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
09:53:43.592 STDOUT terraform1.13.3:       + network_id                                = (known after apply)
09:53:43.592 STDOUT terraform1.13.3:       + numeric_id                                = (known after apply)
09:53:43.592 STDOUT terraform1.13.3:       + project                                   = "iac-01"
09:53:43.592 STDOUT terraform1.13.3:       + routing_mode                              = (known after apply)
09:53:43.592 STDOUT terraform1.13.3:       + self_link                                 = (known after apply)
09:53:43.593 STDOUT terraform1.13.3:     }
09:53:43.593 STDOUT terraform1.13.3:   # google_compute_subnetwork.subnet will be created
09:53:43.593 STDOUT terraform1.13.3:   + resource "google_compute_subnetwork" "subnet" {
09:53:43.593 STDOUT terraform1.13.3:       + creation_timestamp         = (known after apply)
09:53:43.593 STDOUT terraform1.13.3:       + external_ipv6_prefix       = (known after apply)
09:53:43.593 STDOUT terraform1.13.3:       + fingerprint                = (known after apply)
09:53:43.593 STDOUT terraform1.13.3:       + gateway_address            = (known after apply)
09:53:43.593 STDOUT terraform1.13.3:       + id                         = (known after apply)
09:53:43.594 STDOUT terraform1.13.3:       + internal_ipv6_prefix       = (known after apply)
09:53:43.594 STDOUT terraform1.13.3:       + ip_cidr_range              = "10.0.0.0/24"
09:53:43.594 STDOUT terraform1.13.3:       + ipv6_cidr_range            = (known after apply)
09:53:43.594 STDOUT terraform1.13.3:       + ipv6_gce_endpoint          = (known after apply)
09:53:43.594 STDOUT terraform1.13.3:       + name                       = "prd-vpc-australia-southeast2-subnet"
09:53:43.594 STDOUT terraform1.13.3:       + network                    = (known after apply)
09:53:43.594 STDOUT terraform1.13.3:       + private_ip_google_access   = (known after apply)
09:53:43.595 STDOUT terraform1.13.3:       + private_ipv6_google_access = (known after apply)
09:53:43.595 STDOUT terraform1.13.3:       + project                    = "iac-01"
09:53:43.595 STDOUT terraform1.13.3:       + purpose                    = (known after apply)
09:53:43.595 STDOUT terraform1.13.3:       + region                     = "australia-southeast2"
09:53:43.595 STDOUT terraform1.13.3:       + self_link                  = (known after apply)
09:53:43.595 STDOUT terraform1.13.3:       + stack_type                 = (known after apply)
09:53:43.595 STDOUT terraform1.13.3:       + state                      = (known after apply)
09:53:43.595 STDOUT terraform1.13.3:       + subnetwork_id              = (known after apply)
09:53:43.596 STDOUT terraform1.13.3:       + secondary_ip_range (known after apply)
09:53:43.596 STDOUT terraform1.13.3:     }
09:53:43.596 STDOUT terraform1.13.3: Plan: 2 to add, 0 to change, 0 to destroy.
09:53:43.596 STDOUT terraform1.13.3: 
09:53:43.596 STDOUT terraform1.13.3: Changes to Outputs:
09:53:43.596 STDOUT terraform1.13.3:   + network_id       = (known after apply)
09:53:43.596 STDOUT terraform1.13.3:   + subnet_self_link = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d nz3es/gcp/prd/australia-southeast2 -w nz3es_gcp_prd_australia-southeast2
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://www.3es.nz/lock?id=esquare666%252Fiac%252Fnz3es%252Fgcp%252Fprd%252Faustralia-southeast2%252Fnz3es_gcp_prd_australia-southeast2)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d nz3es/gcp/prd/australia-southeast2 -w nz3es_gcp_prd_australia-southeast2
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 2 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```